# Пример 2.10. Деструктуризация вложенных кортежей (необходимая версия Python >= 3.10)

metro_areas = [
    ("Tokyo", "JP", 36.933, (35.689722, 139.691667)),
    ("Delhi NCR", "IN", 21.935, (28.613889, 77.208889)),
    ("Mexico City", "MX", 20.142, (19.433333, -99.133333)),
    ("New York-Newark", "US", 20.104, (40.808611, -74.020386)),
    ("São Paulo", "BR", 19.649, (-23.547778, -46.635833)),
]

def main():
    print(f'{"":15} | {"latitude":>9} | {"longitude":>9}')
    for record in metro_areas:
        match record: # 1
            case [name, _, _, (lat, lon)] if lon <=0: # 2
                print(f'{name:15} | {lat: 9.4f} | {lon: 9.4f}')

if __name__ == '__main__':
    main()

# 1 Субъектом в этом предложении match является record,
#  т.е. каждый из кортежей в списке metro_areas.

# 2 Ветвь case состоит из двух частей: образец и необязательное
#  охранное условие, начинающееся ключевым словом if.
